---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod
source: html/28fcae11-78b7-c34b-d307-20055e71a26e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod

Specifies how analytical model is being aligned in space

## Syntax (C#)
```csharp
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum AnalyticalAlignmentMethod
```